Revit 2026 API

# Transform1DTransformParameterDomain Method

---

Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<double> TransformParameterDomain(
	double domainStart,
	double domainEnd
)
```
```vb
Public Function TransformParameterDomain (
	domainStart As Double,
	domainEnd As Double
) As IList(Of Double)
```
```cpp
public:
IList<double>^ TransformParameterDomain(
	double domainStart,
	double domainEnd
)
```
```fsharp
member TransformParameterDomain :
        domainStart : float *
        domainEnd : float -> IList<float>
```

#### Parameters

domainStart Double
     The original parameter domain start.
domainEnd Double
     The original parameter domain end.

#### Return Value

IListDouble

If the domain is empty it is unchanged.

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace